#+TITLE: Lazy Evaluation
** Filter
#+name:filter
#+begin_src racket :lang sicp :results output :noweb yes :noweb-ref yes
  (define (filter predicate sequence)
    (cond ((null? sequence) nil)
          ((predicate (car sequence)) (cons (car sequence) (filter predicate (cdr sequence))))
          (else (filter predicate (cdr sequence)))))
#+end_src

#+RESULTS:
: (1 3 5)

** Test 
#+begin_src racket :lang sicp
  (list 'quote '())
#+end_src

#+RESULTS:
: (quote ())

#+begin_src racket :lang sicp
  (pair? '())
#+end_src

#+RESULTS:
: #t
